
# 3. Вывести на экран числа от -N до N
N = int (input('Введите число N = '))
print (list (range(-N,N+1)))


